tap "dopplerhq/cli"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jimfangx/riscv"
tap "virtuslab/scala-cli"
# Macro processing language
brew "m4"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Parser generator
brew "bison"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Library for manipulating PNG images
brew "libpng"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Cross-platform make
brew "cmake"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Library and utilities for processing GIFs
brew "giflib"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Pure Scala Artifact Fetching
brew "coursier"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Command-line tool to interact with exercism.io
brew "exercism"
# XML 1.0 parser
brew "expat"
# Lock file during command
brew "flock"
# C library for multiple-precision floating-point computations
brew "mpfr"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Interpreter for PostScript and PDF
brew "ghostscript"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Improved top (interactive process viewer)
brew "htop"
# Website copier/offline browser
brew "httrack"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Integer Set Library for the polyhedral model
brew "isl"
# Image manipulation library
brew "jpeg"
# Interactive environments for writing and running code
brew "jupyterlab"
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# Library to render SVG files using Cairo
brew "librsvg"
# General purpose TCP-IP emulator
brew "libslirp"
# Utility for directing compilation
brew "make"
# QUIC transport protocol implementation
brew "mvfst"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# On-chip debugging, in-system programming and boundary-scan testing
brew "open-ocd"
# Universal utility for programming FPGA
brew "openfpgaloader"
# Development kit for the Java programming language
brew "openjdk@11"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Generic machine emulator and virtualizer
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Build tool for Scala projects
brew "sbt"
# Official documentation format of the GNU project
brew "texinfo"
# Terminal multiplexer
brew "tmux"
# Maintained ctags implementation
brew "universal-ctags"
# Verilog simulator
brew "verilator"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Fake keyboard/mouse input and window management for X
brew "xdotool"
# JavaScript package manager
brew "yarn"
# General-purpose lossless data-compression library
brew "zlib"
# Fast static site generator in a single binary with everything built-in
brew "zola"
# The official Doppler CLI for managing your secrets
brew "dopplerhq/cli/doppler"
# RISC-V toolchain including gcc (with newlib), simulator (spike), and pk
brew "jimfangx/riscv/riscv-tools"
# Launcher for ScalaCli
brew "virtuslab/scala-cli/scala-cli"
# Enable Windows-like alt-tab
cask "alt-tab"
# Android SDK component
cask "android-platform-tools"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Re-mounts write-protected NTFS volumes
cask "mounty"
# Replacement for Docker Desktop
cask "orbstack"
# HTML to PDF renderer
cask "wkhtmltopdf"
# OpenJDK distribution from Azul
cask "zulu@11"
vscode "aeschli.vscode-css-formatter"
vscode "akamud.vscode-theme-onedark"
vscode "burkeholland.simple-react-snippets"
vscode "chrischinchilla.vscode-pandoc"
vscode "clemenspeters.format-json"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "georgewfraser.vscode-javac"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "hm.riscv-venus"
vscode "icrawl.discord-vscode"
vscode "idma88.omp-pragma"
vscode "intel-corporation.ispc"
vscode "james-yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "kevinrose.vsc-python-indent"
vscode "magicstack.magicpython"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "mshr-h.veriloghdl"
vscode "njpwerner.autodocstring"
vscode "qiaojie.binary-viewer"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "sidthesloth.html5-boilerplate"
vscode "sjhuangx.vscode-scheme"
vscode "tecosaur.latex-utilities"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "valentjn.vscode-ltex"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wholroyd.jinja"
vscode "yzane.markdown-pdf"
vscode "zhwu95.riscv"
